c/c99.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-05 四 17:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>c99</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">c99</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org26f4066">1. 概述</a></li>
<li><a href="#orgbdb5b9f">2. features</a>
<ul>
<li><a href="#org0dccc97">2.1. 指定初始化</a></li>
<li><a href="#org44b43a4">2.2. 变长数组(vlna)</a></li>
<li><a href="#org307a445">2.3. long long 类型</a></li>
<li><a href="#orgb54c0e8">2.4. inline 函数</a></li>
<li><a href="#org4450608">2.5. bool 类型</a></li>
<li><a href="#org3a7ebf5">2.6. 复合常量（Compound Literals）</a></li>
<li><a href="#orga4a5e27">2.7. for 循环变量初始化（for loop intializers）</a></li>
<li><a href="#orgb2a9813">2.8. 新增头文件</a></li>
</ul>
</li>
<li><a href="#org368dd64">3. gcc</a></li>
<li><a href="#org4959edd">4. clang</a></li>
</ul>
</div>
</div>

<div id="outline-container-org26f4066" class="outline-2">
<h2 id="org26f4066"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
C89 是最早的 C语言规范，于 1989 年提出，1990 年先由 ANSI(美国国家标准委员会，American National Standards Institute)推出 ANSI 版本，后来被接纳为 ISO 国际标准(ISO/IEC9899:1990)，因而有时也称为 C90，最经典的 C语言教材[K&amp;R]就是基于这个版本的。
</p>

<p>
C99(ISO/IEC9899:1999）是在 1999 年推出的，加入了许多新的特性，这里主要介绍常用的一些特性。
</p>
</div>
</div>

<div id="outline-container-orgbdb5b9f" class="outline-2">
<h2 id="orgbdb5b9f"><span class="section-number-2">2</span> features<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0dccc97" class="outline-3">
<h3 id="org0dccc97"><span class="section-number-3">2.1</span> 指定初始化</h3>
<div class="outline-text-3" id="text-2-1">
<p>
在初始化结构体和数组时，可以通过指定具体成员名或数组下标来赋初值。
</p>
</div>
</div>

<div id="outline-container-org44b43a4" class="outline-3">
<h3 id="org44b43a4"><span class="section-number-3">2.2</span> 变长数组(vlna)</h3>
</div>

<div id="outline-container-org307a445" class="outline-3">
<h3 id="org307a445"><span class="section-number-3">2.3</span> long long 类型</h3>
</div>

<div id="outline-container-orgb54c0e8" class="outline-3">
<h3 id="orgb54c0e8"><span class="section-number-3">2.4</span> inline 函数</h3>
</div>

<div id="outline-container-org4450608" class="outline-3">
<h3 id="org4450608"><span class="section-number-3">2.5</span> bool 类型</h3>
</div>

<div id="outline-container-org3a7ebf5" class="outline-3">
<h3 id="org3a7ebf5"><span class="section-number-3">2.6</span> 复合常量（Compound Literals）</h3>
<div class="outline-text-3" id="text-2-6">
<p>
简单来说复合常量就是允许你定义一个匿名的结构体或数组变量。如：
</p>
</div>
</div>

<div id="outline-container-orga4a5e27" class="outline-3">
<h3 id="orga4a5e27"><span class="section-number-3">2.7</span> for 循环变量初始化（for loop intializers）</h3>
</div>

<div id="outline-container-orgb2a9813" class="outline-3">
<h3 id="orgb2a9813"><span class="section-number-3">2.8</span> 新增头文件</h3>
<div class="outline-text-3" id="text-2-8">
<p>
C89 中标准的头文件：
</p>
<ul class="org-ul">
<li>&lt;assert.h&gt;           定义宏 assert()</li>
<li>&lt;ctype.h&gt;            字符处理</li>
<li>&lt;errno.h&gt;            错误报告</li>
<li>&lt;float.h&gt;            定义与实现相关的浮点值勤</li>
<li>&lt;limits.h&gt;           定义与实现相关的各种极限值</li>
<li>&lt;locale.h&gt;           支持函数 setlocale()</li>
<li>&lt;math.h&gt;             数学函数库使用的各种定义</li>
<li>&lt;setjmp.h&gt;           支持非局部跳转</li>
<li>&lt;signal.h&gt;           定义信号值</li>
<li>&lt;stdarg.h&gt;           支持可变长度的参数列表</li>
<li>&lt;stddef.h&gt;           定义常用常数</li>
<li>&lt;stdio.h&gt;            支持文件输入和输出</li>
<li>&lt;stdlib.h&gt;           其他各种声明</li>
<li>&lt;string.h&gt;           字符串函数</li>
<li>&lt;time.h&gt;             支持系统时间函数</li>
</ul>

<p>
C99 新增的头文件
</p>
<ul class="org-ul">
<li>&lt;complex.h&gt;          支持复杂算法</li>
<li>&lt;fenv.h&gt;             给出对浮点状态标记和浮点环境的其他方面的访问</li>
<li>&lt;inttypes.h&gt;         定义标准的、可移植的整型类型集合,也支持处理最大宽度整数的函数</li>
<li>&lt;iso646.h&gt;           首先在此 1995 年第一次修订时引进,用于定义对应各种运算符的宏</li>
<li>&lt;stdbool.h&gt;          支持布尔数据类型类型,定义宏 bool,以便兼容于 C++</li>
<li>&lt;stdint.h&gt;           定义标准的、可移植的整型类型集合,该文件包含在&lt;inttypes.h&gt;中</li>
<li>&lt;tgmath.h&gt;           定义一般类型的浮点宏</li>
<li>&lt;wchar.h&gt;            首先在 1995 年第一次修订时引进,用于支持多字节和宽字节函数</li>
<li>&lt;wctype.h&gt;           首先在 1995 年第一次修订时引进,用于支持多字节和宽字节分类函数</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org368dd64" class="outline-2">
<h2 id="org368dd64"><span class="section-number-2">3</span> gcc</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-sh">-std=c99
</pre>
</div>
</div>
</div>

<div id="outline-container-org4959edd" class="outline-2">
<h2 id="org4959edd"><span class="section-number-2">4</span> clang</h2>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.cnblogs.com/wuyudong/p/c99-new-feature.html">https://www.cnblogs.com/wuyudong/p/c99-new-feature.html</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-05 四 17:00</p>
<p class="validation"></p>
</div>
</body>
</html>
